app/controllers/api/v1/departments_controller.rb

SELECT "departments".* FROM "departments"
---
    def index
      @departments = Department.all